writeup/writeup.org
#+TITLE: The Effect of Pruning on Adversarial Vulnerability
#+AUTHOR: James Gilles
#+EMAIL: jhgilles@mit.edu
#+DATE: 01 November 2019
#+OPTIONS: tex:t latex:t
#+STARTUP: latexpreview

#+LATEX_CLASS: article

#+LATEX_HEADER: % Optional math commands from https://github.com/goodfeli/dlbook_notation.
#+LATEX_HEADER: \usepackage{iclr2020_conference,times}
#+LATEX_HEADER: \input{math_commands.tex}
#+LATEX_HEADER: \usepackage{hyperref}
#+LATEX_HEADER: \usepackage{url}

#+LATEX_HEADER: \newcommand{\xv}[0]{\mathbf{x}}
#+LATEX_HEADER: \newcommand{\yv}[0]{\mathbf{y}}
#+LATEX_HEADER: \newcommand{\zv}[0]{\mathbf{z}}
#+LATEX_HEADER: \newcommand{\fv}[0]{\mathbf{f}}
#+LATEX_HEADER: \newcommand{\J}[0]{\mathbf{J}}
#+LATEX_HEADER: \newcommand{\gv}[0]{\mathbf{g}}
#+LATEX_HEADER: \newcommand{\hv}[0]{\mathbf{h}}
#+LATEX_HEADER: \newcommand{\hxo}[0]{\mathbf{h}_0}

#+LATEX_HEADER: \usepackage{mathtools}

#+LATEX_HEADER:
#+LATEX_HEADER: \DeclarePairedDelimiter\abs{\lvert}{\rvert}%
#+LATEX_HEADER: \DeclarePairedDelimiter\norm{\lVert}{\rVert}%
#+LATEX_HEADER:
#+LATEX_HEADER: % Swap the definition of \abs* and \norm*, so that \abs
#+LATEX_HEADER: % and \norm resizes the size of the brackets, and the
#+LATEX_HEADER: % starred version does not.
#+LATEX_HEADER: \makeatletter
#+LATEX_HEADER: \let\oldabs\abs
#+LATEX_HEADER: \def\abs{\@ifstar{\oldabs}{\oldabs*}}
#+LATEX_HEADER: %
#+LATEX_HEADER: \let\oldnorm\norm
#+LATEX_HEADER: \def\norm{\@ifstar{\oldnorm}{\oldnorm*}}
#+LATEX_HEADER: \makeatother

#+LATEX_HEADER: \newcommand*{\approxident}{%
#+LATEX_HEADER: \mathrel{\vcenter{\offinterlineskip
#+LATEX_HEADER: \hbox{$\sim$}\vskip-.35ex\hbox{$\sim$}\vskip}}}

#+LATEX_HEADER: % uhhh
#+LATEX_HEADER: \renewcommand*{\tableofcontents}{}

#+LATEX_HEADER: \iclrfinaltrue

\today

* The effect of pruning in standard training on adversarial accuracy

  The simplest question I've been trying to answer is: what is the effect of deep neural network pruning on adversarial vulnerability?
  Does it provide any form of defense, or increase vulnerability?

  Adversarial examples present thorny theoretical and practical problems.
  Models that are not resilient to small perturbations are not safe to deploy in many situations;
  moreover, they highlight our fundamental lack of understanding of the internal function of deep neural networks.
  Developing defenses against them is critical for improving the trustworthiness of deep networks.

  One key defense, originally identified in [[citep:TowardsResistantAdversarial]], is simply adding more capacity to networks: doubling or quadrupling
  the number of channels in every layer of a network. This improves resilience, but bloats network model sizes and increases runtime cost.

  One approach to ameliorating these issues is network pruning: zeroing weights or whole channels, to reclaim space, and potentially speed up network
  evaluation. Unfortunately, pruning can often reduce network accuracy; it's also possible it would make networks more or less vulnerable to adversaries.
  Several other works have attempted to apply various kinds of pruning/compression in the adversarial setting
  [[citep:ToCompressOrnot]] [[citep:RobustnessOrCompression]] [[citep:DefensiveQuantization]].

  The difference in my approach is that I have access to models trained using "network rewinding", as introduced by [[citep:StabilizingLTH]]. This is a
  new style of network pruning that, while computationally expensive, can actually *increase* network accuracy, and also retain accuracy longer into the pruning
  regimen.

  Here I'll try attacking some pruned networks over the course of training, comparing their standard and adversarial accuracies.

  I'm comparing two types of pruning, iterated fine-tuning and iterated rewinding. The networks are ResNetV1-20s trained on CIFAR10. The attack I'm using is
  untargeted Projected Gradient Descent, using 5 iterations, the $l_\infty$ norm, and an epsilon of .004. [fn:1]

[fn:1]This is the smallest reasonable epsilon to use, corresponding to changing each 8-bit RGBA channel in the image by a maximum of 1. Larger epsilons saturate adversarial accuracy immediately, making them not useful for comparison. Epsilon is applied on an image with channel values in the range $[0,1]$, and clipped; that is, the attack is applied before data normalization.]

  We see that adversarial accuracy starts out very low and is *reduced* by additional pruning, similar to standard accuracy.

  Note: to read the x-axis, know that each pruning iteration reduces network density by approximately 20%, and then fully retrains the network.
  See figure [[ref:fig:marginal]] for a plot of network density over the course of pruning.

  \newpage

  To compare how quickly adversarial accuracy is reduced compared to standard accuracy, we can normalize all training runs by their starting
  accuracy.

  We can now see that adversarial accuracy drops off *faster* than standard accuracy over the course of network pruning. It's also more chaotic,
  for reasons that aren't clear.

  Note: currently these experiments don't show the entire accuracy regime. The available data only goes to 20 rewinding/finetuning iterations,
  in which time accuracy has not dropped to 0.

  Over this data axis, rewinding doesn't seem to have any consistent advantage over fine-tuning.

  We can visualize the changes made to the input images; see figure [[ref:fig:sample]].


  We can also examine the influence of changing attack parameters on a particular pruned network.
  Here, I fix the pruning iteration at 10, and vary the parameters of PGD.

  This smooth continuum of epsilon is, of course, not realistic for real-world attacks, since most image formats quantize
  all channels to 8 bits. However, it's useful to understand the dynamics of the network.

  We can see that increasing epsilon continuously degrades performance, while increasing PGD strength saturates fairly quickly. Interestingly,
  lottery-ticket-style rewinding does seem to have a small advantage in a particular epsilon regime, even when the data are normalized by starting accuracy.
  However, this advantage vanishes as the adversary increases in strength.

  So we see that lottery-ticket-style training with rewinding does not provide any meaningful defense on its own.
  However, it's an open question whether it can be usefully combined with other adversarial defenses.

* Work for the next month

   "Winning tickets" are networks that can be trained in a pruned state, often yielding higher
   ending accuracy. They're found by training the network fully, pruning the final network,
   and then rewinding to a step early in training.

   Now that I've got my infrastructure set up, it should be relatively straightforward to
   attempt combining this strategy with adversarial training. I'd like to investigate the
   potential existence of adversarial lottery tickets,
   as well as effects of swapping training regimes before / after pruning.

   If we use oneshot pruning, we can draw a dividing line at the rewinding operation, and use one type of training
   beforehand, and a possibly different style of training. We can contextualize this set of possible experiments as a box, with the post-training regime on the x
   axis and the pre-training regime on the y axis:

 |                          | standard post-training | adversarial post-training |
 |--------------------------+------------------------+---------------------------|
 | standard pre-training    | *standard LTH*         |                           |
 | adversarial pre-training |                        |                           |

 The questions I'd like to answer fit into this box. Standard LTH training is the top-left quadrant: standard
 training for both regimes.

