writeup/writeup.tex
% Created 2019-12-16 Mon 10:40
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
% Optional math commands from https://github.com/goodfeli/dlbook_notation.
\usepackage{iclr2020_conference,times}
\input{math_commands.tex}
\usepackage{hyperref}
\usepackage{url}
\newcommand{\xv}[0]{\mathbf{x}}
\newcommand{\yv}[0]{\mathbf{y}}
\newcommand{\zv}[0]{\mathbf{z}}
\newcommand{\fv}[0]{\mathbf{f}}
\newcommand{\J}[0]{\mathbf{J}}
\newcommand{\gv}[0]{\mathbf{g}}
\newcommand{\hv}[0]{\mathbf{h}}
\newcommand{\hxo}[0]{\mathbf{h}_0}
\usepackage{mathtools}
\DeclarePairedDelimiter\abs{\lvert}{\rvert}%
\DeclarePairedDelimiter\norm{\lVert}{\rVert}%
% Swap the definition of \abs* and \norm*, so that \abs
% and \norm resizes the size of the brackets, and the
% starred version does not.
\makeatletter
\let\oldabs\abs
\def\abs{\@ifstar{\oldabs}{\oldabs*}}
%
\let\oldnorm\norm
\def\norm{\@ifstar{\oldnorm}{\oldnorm*}}
\makeatother
\newcommand*{\approxident}{%
\mathrel{\vcenter{\offinterlineskip
\hbox{$\sim$}\vskip-.35ex\hbox{$\sim$}\vskip}}}
% uhhh
\renewcommand*{\tableofcontents}{}
\iclrfinaltrue
\author{James Gilles}
\date{01 November 2019}
\title{The Effect of Pruning on Adversarial Vulnerability}
\hypersetup{
 pdfauthor={James Gilles},
 pdftitle={The Effect of Pruning on Adversarial Vulnerability},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.2.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\today

\section{The effect of pruning in standard training on adversarial accuracy}
\label{sec:org708dca6}

The simplest question I've been trying to answer is: what is the effect of deep neural network pruning on adversarial vulnerability?
Does it provide any form of defense, or increase vulnerability?

Adversarial examples present thorny theoretical and practical problems.
Models that are not resilient to small perturbations are not safe to deploy in many situations;
moreover, they highlight our fundamental lack of understanding of the internal function of deep neural networks.
Developing defenses against them is critical for improving the trustworthiness of deep networks.

One key defense, originally identified in \citep{TowardsResistantAdversarial}, is simply adding more capacity to networks: doubling or quadrupling
the number of channels in every layer of a network. This improves resilience, but bloats network model sizes and increases runtime cost.

One approach to ameliorating these issues is network pruning: zeroing weights or whole channels, to reclaim space, and potentially speed up network
evaluation. Unfortunately, pruning can often reduce network accuracy; it's also possible it would make networks more or less vulnerable to adversaries.
Several other works have attempted to apply various kinds of pruning/compression in the adversarial setting
\citep{ToCompressOrnot} \citep{RobustnessOrCompression} \citep{DefensiveQuantization}.

The difference in my approach is that I have access to models trained using "network rewinding", as introduced by \citep{StabilizingLTH}. This is a
new style of network pruning that, while computationally expensive, can actually \textbf{increase} network accuracy, and also retain accuracy longer into the pruning
regimen.

Here I'll try attacking some pruned networks over the course of training, comparing their standard and adversarial accuracies.

I'm comparing two types of pruning, iterated fine-tuning and iterated rewinding. The networks are ResNetV1-20s trained on CIFAR10. The attack I'm using is
untargeted Projected Gradient Descent, using 5 iterations, the \(l_\infty\) norm, and an epsilon of .004. \footnote{This is the smallest reasonable epsilon to use, corresponding to changing each 8-bit RGBA channel in the image by a maximum of 1. Larger epsilons saturate adversarial accuracy immediately, making them not useful for comparison. Epsilon is applied on an image with channel values in the range \([0,1]\), and clipped; that is, the attack is applied before data normalization.]

We see that adversarial accuracy starts out very low and is \textbf{reduced} by additional pruning, similar to standard accuracy.

Note: to read the x-axis, know that each pruning iteration reduces network density by approximately 20\%, and then fully retrains the network.
See figure \ref{fig:marginal} for a plot of network density over the course of pruning.

\newpage

To compare how quickly adversarial accuracy is reduced compared to standard accuracy, we can normalize all training runs by their starting
accuracy.

We can now see that adversarial accuracy drops off \textbf{faster} than standard accuracy over the course of network pruning. It's also more chaotic,
for reasons that aren't clear.

Note: currently these experiments don't show the entire accuracy regime. The available data only goes to 20 rewinding/finetuning iterations,
in which time accuracy has not dropped to 0.

Over this data axis, rewinding doesn't seem to have any consistent advantage over fine-tuning.

We can visualize the changes made to the input images; see figure \ref{fig:sample}.}

We can also examine the influence of changing attack parameters on a particular pruned network.
Here, I fix the pruning iteration at 10, and vary the parameters of PGD.

This smooth continuum of epsilon is, of course, not realistic for real-world attacks, since most image formats quantize
all channels to 8 bits. However, it's useful to understand the dynamics of the network.

We can see that increasing epsilon continuously degrades performance, while increasing PGD strength saturates fairly quickly. Interestingly,
lottery-ticket-style rewinding does seem to have a small advantage in a particular epsilon regime, even when the data are normalized by starting accuracy.
However, this advantage vanishes as the adversary increases in strength.

So we see that lottery-ticket-style training with rewinding does not provide any meaningful defense on its own.
However, it's an open question whether it can be usefully combined with other adversarial defenses.

\section{Work for the next month}
\label{sec:org7c08006}

"Winning tickets" are networks that can be trained in a pruned state, often yielding higher
ending accuracy. They're found by training the network fully, pruning the final network,
and then rewinding to a step early in training.

Now that I've got my infrastructure set up, it should be relatively straightforward to
attempt combining this strategy with adversarial training. I'd like to investigate the
potential existence of adversarial lottery tickets,
as well as effects of swapping training regimes before / after pruning.

If we use oneshot pruning, we can draw a dividing line at the rewinding operation, and use one type of training
beforehand, and a possibly different style of training. We can contextualize this set of possible experiments as a box, with the post-training regime on the x
axis and the pre-training regime on the y axis:

\begin{center}
\begin{tabular}{lll}
 & standard post-training & adversarial post-training\\
\hline
standard pre-training & \textbf{standard LTH} & \\
adversarial pre-training &  & \\
\end{tabular}
\end{center}

The questions I'd like to answer fit into this box. Standard LTH training is the top-left quadrant: standard
training for both regimes.
