writeup/writeup.tex

\subsection{Question 1: are there "winning tickets" in the context of adversarial training?}
\label{sec:org839be2e}

That is, can we find networks that recover \textbf{adversarial} accuracy when trained
adversarially, pruned,
and then rewound and re-trained adversarially?

\begin{center}
\begin{tabular}{lll}
 & standard post-training & adversarial post-training\\
\hline
standard pre-training & standard LTH & \\
adversarial pre-training &  & \textbf{Question 1}\\
\end{tabular}
\end{center}

\citep{RobustnessOrCompression} attempted to answer this question, but failed because they didn't use rewinding;
\citep{anonymous2020boosting} also attempted to answer the question without rewinding, instead using hyperparameter search
to find functional networks.

I'll need to sweep over the rewinding iteration, because the necessary iteration has been found to vary between tasks and architectures.

Independent variables:
\begin{itemize}
\item Oneshot pruning rate
\item Rewinding iteration
\end{itemize}

Dependent variables:
\begin{itemize}
\item Adversarial accuracy
\end{itemize}

Possible outcomes:
\begin{itemize}
\item \textbf{Winning tickets recover pre-pruning accuracy.}
This outcome has practical implications for adversarial training.

\item \textbf{Winning tickets do not recover pre-pruning accuracy}.
This outcome would be an interesting counterexample to the lottery ticket phenomenon.
\end{itemize}

I have some preliminary data suggesting that tickets do exist, but I'd like to evaluate that more systematically.

\subsection{Question 2: can I re-train standard lottery tickets in the adversarial setting?}
\label{sec:org59c5664}
Adversarial training is expensive; next we can ask, is it possible to use adversarially training with a standard winning ticket,
in order to gain the benefits of lottery ticket training?

\begin{center}
\begin{tabular}{lll}
 & standard post-training & adversarial post-training\\
\hline
standard pre-training & standard LTH & \textbf{Question 2}\\
adversarial pre-training &  & Question 1\\
\end{tabular}
\end{center}

\citep{anonymous2020boosting} attempted to answer this question, but, again, didn't use rewinding. They also varied the strength of the
adversary in initial training (the number of PGD iterations), since a weak adversary is still much cheaper to compute than a strong adversary.

Independent variable:
\begin{itemize}
\item Whether training before pruning is adversarial or not.
\item Pruning rate
\item Pre-training adversary strength
\end{itemize}

Dependent variable:
\begin{itemize}
\item Adversarial accuracy
\end{itemize}

Possible outcomes:
\begin{itemize}
\item \textbf{Standard winning tickets reach the same accuracy} as adversarial winning tickets when
retrained adversarially:
This outcome has useful practical implications. It also would show that tickets are in some sense "general".

\item \textbf{Weak-adversary winning tickets reach the same accuracy} as strong-adversary winning tickets when
retrained adversarially:
This result would replicate \citep{anonymous2020boosting} without (as much) expensive hyperparameter search.

\item \textbf{Standard winning tickets reach a lower accuracy} as adversarial winning tickets when
retrained adversarially:
This outcome would show that tickets are not transferable between tasks.
\end{itemize}

\subsection{Question 3: can a standard training maintain the robustness of an adversarially-trained winning ticket?}
\label{sec:orgd4a0873}
We can also ask the inverse question: will an adversarially-robust winning ticket maintain robustness \footnote{"Robustness" is Madry's term for adversarial resilience, i.e., adversarial accuracy, roughly speaking.]} when retrained with a weaker
(or, no) adversary?

\begin{center}
\begin{tabular}{lll}
 & standard post-training & adversarial post-training\\
\hline
standard pre-training & standard LTH & Question 2\\
adversarial pre-training & \textbf{Question 3} & Question 1\\
\end{tabular}
\end{center}

Independent variable:
\begin{itemize}
\item Whether training before pruning is adversarial or not.
\item Pruning rate
\item Post-training adversary strength
\end{itemize}

Dependent variable:
\begin{itemize}
\item Adversarial accuracy
\end{itemize}

Possible outcomes:
\begin{itemize}
\item \textbf{Adversarial tickets do not need to be retrained adversarially} to maintain robustness:
This would be a \textbf{very} interesting result. It has implications connected to the other work
related to stability and basins of attraction going on in the lab.

This would provide strong evidence for the lottery ticket hypothesis, suggesting that the basin of attraction found by early training
determines most network properties.

\item \textbf{Strong adversarial tickets need only a weak post-training adversary} to maintain robustness:
Similar to the above, this suggests that a strong adversary is only needed to find the initial basin of attraction, and a weak
adversary is sufficient to stay in it.

\item \textbf{Adversarial tickets do need to be retrained adversarially} to maintain robustness:
The null hypothesis. I strongly suspect this will be the case.
\end{itemize}

\subsection{Question 4: how small can I make an adversarially trained network?}
\label{sec:orgc883343}
\citep{TowardsResistantAdversarial} found that simply adding capacity to adversarially-trained networks can
improve accuracy. They suggest conceiving of adversarial training as a min-max problem:

$$\min_\theta \rho(\theta), \mathrm{where}\; \rho(\theta) = E_{(x,y)\sim D}[\max_{\delta \in S} L(\theta, x+\delta, y) ]$$

where:

\(D\): training set

\(L\): network loss

\(\theta\): parameters

\(S \subseteq \mathbb{R}^d\), some space of allowed perturbations

That is, adversarial training is the problem of empirically minimizing training loss, when an adversary is permitted to perturb all
inputs in some subspace to maximize training loss. According to this view, adversarial training requires learning more complex
decision boundaries; it's a harder problem.

However, some more recent work (\citep{NotBugsFeatures}, \citep{HighFreqGeneralization}) has found that adversarial training can actually be thought of as training the network not to use "human-uninterpretable input features". This line of thinking suggests that many datasets have \textbf{predictive} input features that make no sense to humans. According to this view, it might be possible to prune adversarial networks even further than standard networks. Perhaps, then, the additional capacity is only needed during parameter search; or maybe the extra activations are needed,
but the same or fewer numbers of parameters are required in adversarial training.

By training Wide ResNets \citep{WideResNets} I can easily vary network width as a parameter.

This brings us back to the bottom-right corner:

\begin{center}
\begin{tabular}{lll}
 & standard post-training & adversarial post-training\\
\hline
standard pre-training & standard LTH & Question 2\\
adversarial pre-training & Question 3 & Question 1, \textbf{Question 4}\\
\end{tabular}
\end{center}

Independent variables:
\begin{itemize}
\item Network width
\item Pruning rate
\end{itemize}

Dependent variables:
\begin{itemize}
\item Adversarial accuracy
\end{itemize}

Possible outcomes:
\begin{itemize}
\item \textbf{Wider networks can be pruned to the same parameter count} as un-widened networks:
Perhaps provides indirect evidence for \citep{NotBugsFeatures}.
Has practical implications.

\item \textbf{Wider networks can be pruned of the same percentage of weights} as un-widened networks:
The null hypothesis.
\end{itemize}
