writeup/writeup.tex


\subsection{Engineering plan / timeline}
\label{sec:org1760af4}
I'll be attempting to answer the above question in the order written; Question 1 will require me to build out some more infrastructure,
which I can then use to straightforwardly answer the other questions.

First, I'll need to build out infrastructure to parallelize training grids, since my current code only trains on a single node.
Implementing this from scratch would be a herculean task, so I intend to leverage the Dask (\url{https://dask.org/}) python library.

Dask is a very widely-used distributed data science library. It allows users to define a grid -- or, more generally, a DAG -- of
tasks. A "task" can be any idempotent python function which returns a python object; for example, an epoch of network training.
Outputs from one task can be fed to later tasks.

Once you've defined your DAG, you boot up a set of machines, have them all connect to a supervisor machine, and submit your DAG. Dask will then
evaluate it in parallel across all the machines, transparently handling node failure and reporting of intermediate results. This works
with hardware accelerators on the machines; you just use whatever python libraries you normally would.

I'm hoping dask will make it quite straightforward to parallelize my current grid evaluation code. My rough timeline is:

\begin{itemize}
\item 1 week: setup training in parallel with Dask on TPU
\item 1 week: make sure training is replicating previous results + answer question 1
\item 1 week: answer questions 2 + 3
\item 1 week: answer question 4
\end{itemize}

We'll see how well this goes.


\section{Future work}
\label{sec:orgc971220}
Here's some brief descriptions of potential future work after this round of experiments.

\subsection{Can pruning be combined with other network augmentations?}
\label{sec:org696201c}
Recent work has suggested that removing BatchNorm layers \citep{BatchNormBad} and regularizing network filters to have lipschitz constants less than 1 \citep{ParsevalNetworks} can significantly improve adversarial robustness when combined with adversarial training. It would be interesting
to see whether these augmentations can be combined with pruning. It might be necessary to add other regularizations such as Dropout when removing
BatchNorm on very wide layers.

\subsection{Pruning rates under nonsense datasets}
\label{sec:orgb75c7a5}
Swapping out either the inputs or labels of a training dataset for random values can show a variety of results. \citep{NotBugsFeatures} trained a network on reassigned adversarial labels to show that adversarial features are predictive; other works
have studied the capacity of networks for memorization under random features and labels.

Studying possible pruning rates in this setting would let me study how relatively "difficult" different tasks are, in terms of necessary parameter counts.

An alternative metric to investigate would be Network Dissection IoU \citep{netdissect2017}, or the modified netdissect IoU termed "network consistency" developed in \citep{AdvTowardsInterpretability}.

There may also be connections between Network Dissections and the stability work going on in other parts of the lab.

\section{Conclusion}
\label{sec:orgfb25c79}
That's my results for this month and my plans for next month. Let me know if you have any feedback.

\bibliography{../notes/literature/everything.bib}
\bibliographystyle{iclr2020_conference}
\end{document}
